Revit 2026 API

# ScheduleDefinitionCanFilterByParameterExistence Method

---

Checks whether a field can be used with a HasParameter filter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanFilterByParameterExistence(
	ScheduleFieldId fieldId
)
```
```vb
Public Function CanFilterByParameterExistence (
	fieldId As ScheduleFieldId
) As Boolean
```
```cpp
public:
bool CanFilterByParameterExistence(
	ScheduleFieldId^ fieldId
)
```
```fsharp
member CanFilterByParameterExistence :
        fieldId : ScheduleFieldId -> bool
```

#### Parameters

fieldId ScheduleFieldId
     The ID of the field to check.

#### Return Value

Boolean True if the field can be used with a HasParameter filter, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | fieldId is not the ID of a field in this ScheduleDefinition. |
| ArgumentNullException | A non-optional argument was null |

The HasParameter filter type only supports shared parameters, and only with the Instance or ElementType field types.

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace